iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаХряка/КарточкаХряка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаХряка</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПричины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытия</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОтец</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоМать</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыМать</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСлучка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоСвиноматка</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРожденияСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыСвиноматка</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытиеСвиноматка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыбытияСвиноматка</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРаботника</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпоросаСвиноматка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DanAvlTagID</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ПлемСтадо/ПлемСтадо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлемСтадо</name>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИндекса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМатьПорода</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтецПорода</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Стадо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналВыбраковки/ЖурналВыбраковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналВыбраковки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Хряк</name>
  </enumValues>
  <enumValues>
    <name>Свинка</name>
  </enumValues>
</mdclass:Enum>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Отбор = Новый Структура("НомерЖивотного",Запись.НомерЖивотного);
	//НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СрезПоследних(Дата(Запись.Период),Отбор);
	//Если НаборЗаписей.Количество() = 0 Тогда    
	Если (Запись.Период <> ТекущаяДатаВвода Или Запись.НомерЖивотного <> ТекущийНомерЖивотного)
		И (ТекущийНомерЖивотного <> Справочники.НомерЖивотного.ПустаяСсылка()) Тогда
		ПолучитьКарточкуСвиноматкиНаСервере();
		СменитьНомерЖивотногоНаСервере(ТекущийНомерЖивотного, ТекущаяДатаВвода, Запись.НомерЖивотного, Запись.Период);
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.КарточкаСвиноматки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
	НаборЗаписей.Отбор.Период.Установить(Запись.Период);
	НаборЗаписей.Прочитать();
	НаборЗаписей1 = РегистрыСведений.КарточкаХряка.СоздатьНаборЗаписей();
	НаборЗаписей1.Отбор.НомерЖивотного.Установить(Запись.НомерЖивотного);
	НаборЗаписей1.Отбор.Период.Установить(Запись.Период);
	НаборЗаписей1.Прочитать();
	Если Запись.Пол = Перечисления.Пол.Хряк Тогда
		Если НаборЗаписей1.Количество() = 0 Тогда
			НоваяСтрока1 = РегистрыСведений.КарточкаХряка.СоздатьМенеджерЗаписи();
			НоваяСтрока1.Период = Запись.Период;
			НоваяСтрока1.НомерЖивотного = Запись.НомерЖивотного;
			НоваяСтрока1.ДатаРождения = Запись.ДатаРождения;
			НоваяСтрока1.КодПороды = Запись.КодПороды;
			//НоваяСтрока1.ДатаВыбытие = Запись.ДатаВыбытие;
			//НоваяСтрока1.МассаВыбытие = Запись.МассаВыбытие;
			НоваяСтрока1.НомерЖивотногоОтец = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиОтец);
			НоваяСтрока1.НомерЖивотногоМать = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиМать);
			НоваяСтрока1.Записать();
			//НоваяСтрока2 = Документы.КарточкаХрякаДок.СоздатьДокумент();
			//НоваяСтрока2.Дата = ТекущаяДата();
			//НоваяСтрока2.НомерЖивотного = Запись.НомерЖивотного;
			//НоваяСтрока2.ДатаРождения = Запись.ДатаРождения;
			//НоваяСтрока2.КодПороды = Запись.КодПороды;
			//НоваяСтрока2.НазваниеПороды = Запись.НазваниеПороды;
			//НоваяСтрока2.ДатаВыбытие = Запись.ДатаВыбытие;
			//НоваяСтрока2.МассаВыбытие = Запись.МассаВыбытие;
			//НоваяСтрока2.НомерЖивотногоОтец = Запись.НомерЖивотногоОтец;
			//НоваяСтрока2.НомерЖивотногоМать = Запись.НомерЖивотногоМать;
			//НоваяСтрока2.Записать();
		Иначе
			Для Каждого СтрНаборЗаписей Из НаборЗаписей1 Цикл
				СтрНаборЗаписей.Период 				= Запись.Период;
				СтрНаборЗаписей.НомерЖивотного 		= Запись.НомерЖивотного;
				СтрНаборЗаписей.ДатаРождения 		= Запись.ДатаРождения;
				СтрНаборЗаписей.КодПороды 			= Запись.КодПороды;
				//СтрНаборЗаписей.НазваниеПороды = Запись.НазваниеПороды;
				//СтрНаборЗаписей.МассаВыбытие = Запись.МассаВыбытие;
				СтрНаборЗаписей.НомерЖивотногоОтец = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиОтец);
				СтрНаборЗаписей.НомерЖивотногоМать = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиМать);
				
				//СтрНаборЗаписей.МассаВвод = Запись.МассаВвод;
			КонецЦикла;
			НаборЗаписей1.Записать();
		КонецЕсли;
	ИначеЕсли Запись.Пол = Перечисления.Пол.Свинка Тогда
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяСтрока = РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
			НоваяСтрока.НомерЖивотного = Запись.НомерЖивотного;
			НоваяСтрока.ДатаРождения = Запись.ДатаРождения;
			НоваяСтрока.КодПороды = Запись.КодПороды;
			НоваяСтрока.IDНомер = Запись.IDНомер;
			НоваяСтрока.УшнойВыщип = Запись.УшнойВыщип;
			НоваяСтрока.Период = Запись.Период;
			НоваяСтрока.МассаВвод = Запись.МассаВвод;
			НоваяСтрока.НомерЖивотногоМать = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиМать);
			НоваяСтрока.НомерЖивотногоОтец = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиОтец);
			НоваяСтрока.ДатаВыбытие 		= Запись.ДатаВыбытие;
			НоваяСтрока.ПричинаВыбытия		=  Запись.КодВыбытие;
			НоваяСтрока.Записать();
		Иначе
			Для Каждого СтрНаборЗаписей Из НаборЗаписей Цикл
				СтрНаборЗаписей.НомерЖивотного = Запись.НомерЖивотного;
				СтрНаборЗаписей.ДатаРождения = Запись.ДатаРождения;
				СтрНаборЗаписей.КодПороды = Запись.КодПороды;
				СтрНаборЗаписей.IDНомер = Запись.IDНомер;
				СтрНаборЗаписей.УшнойВыщип = Запись.УшнойВыщип;
				СтрНаборЗаписей.Период = Запись.Период;
				СтрНаборЗаписей.МассаВвод = Запись.МассаВвод;
				СтрНаборЗаписей.НомерЖивотногоМать = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиМать);
				СтрНаборЗаписей.НомерЖивотногоОтец = Справочники.НомерЖивотного.НайтиПоКоду(Запись.РодителиОтец);
				СтрНаборЗаписей.ДатаВыбытие 		= Запись.ДатаВыбытие;
				СтрНаборЗаписей.ПричинаВыбытия		=  Запись.КодВыбытие;

			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Запись.DGTagId) Тогда
		ЗаписьРегистра = РегистрыСведений.ПлемСтадо.СоздатьНаборЗаписей();
		ЗаписьРегистра.Отбор.DGTagId.Установить(Запись.DGTagId);
		ЗаписьРегистра.Прочитать();
		Если ЗаписьРегистра.Количество() > 0 Тогда
			Для Каждого Стр Из ЗаписьРегистра Цикл
				Стр.НомерЖивотного	= Запись.НомерЖивотного;
				Стр.ДатаВвода		= Запись.Период;
			КонецЦикла;
		КонецЕсли;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;

	Если ЗначениеЗаполнено(Запись.IDНомер) Тогда
		ЗаписьРегистра = РегистрыСведений.ПлемСтадо.СоздатьНаборЗаписей();
		ЗаписьРегистра.Отбор.IDНомер.Установить(Запись.IDНомер);
		ЗаписьРегистра.Прочитать();
		Если ЗаписьРегистра.Количество() > 0 Тогда
			Для Каждого Стр Из ЗаписьРегистра Цикл
				Стр.НомерЖивотного	= Запись.НомерЖивотного;
				Стр.ДатаВвода		= Запись.Период;
			КонецЦикла;
		КонецЕсли;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.КарточкаСвиноматки.Форма.ФормаЗаписи", Новый Структура("Ключ", ПолучитьКлючЗаписи(
		Запись.НомерЖивотного, Запись.Период)), Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписи(НомерЖивотного, Период)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаСвиноматкиСрезПоследних.Период КАК Период,
	|	КарточкаСвиноматкиСрезПоследних.НомерЖивотного КАК НомерЖивотного,
	|	КарточкаСвиноматкиСрезПоследних.ДатаРождения КАК ДатаРождения,
	|	КарточкаСвиноматкиСрезПоследних.КодПороды КАК КодПороды,
	|	КарточкаСвиноматкиСрезПоследних.IDНомер КАК IDНомер,
	|	КарточкаСвиноматкиСрезПоследних.УшнойВыщип КАК УшнойВыщип,
	|	КарточкаСвиноматкиСрезПоследних.ЛевыхСосков КАК ЛевыхСосков,
	|	КарточкаСвиноматкиСрезПоследних.ПравыхСосков КАК ПравыхСосков,
	|	КарточкаСвиноматкиСрезПоследних.НомерЖивотногоОтец КАК НомерЖивотногоОтец,
	|	КарточкаСвиноматкиСрезПоследних.ДатаРожденияОтец КАК ДатаРожденияОтец,
	|	КарточкаСвиноматкиСрезПоследних.НомерЖивотногоМать КАК НомерЖивотногоМать,
	|	КарточкаСвиноматкиСрезПоследних.ДатаРожденияМать КАК ДатаРожденияМать,
	|	КарточкаСвиноматкиСрезПоследних.Статус КАК Статус,
	|	КарточкаСвиноматкиСрезПоследних.ДатаАбортаОпороса КАК ДатаАбортаОпороса,
	|	КарточкаСвиноматкиСрезПоследних.Пролечено КАК Пролечено,
	|	КарточкаСвиноматкиСрезПоследних.ДатаВакцинации КАК ДатаВакцинации,
	|	КарточкаСвиноматкиСрезПоследних.НомерОпороса КАК НомерОпороса
	|ИЗ
	|	РегистрСведений.КарточкаСвиноматки.СрезПоследних КАК КарточкаСвиноматкиСрезПоследних
	|ГДЕ
	|	КарточкаСвиноматкиСрезПоследних.Период = &Период
	|	И КарточкаСвиноматкиСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", НомерЖивотного);
	Запрос.УстановитьПараметр("Период", Период);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначениеКлюча = Новый Структура;
		ЗначениеКлюча.Вставить("НомерЖивотного", ВыборкаДетальныеЗаписи.НомерЖивотного);
		ЗначениеКлюча.Вставить("Период", ВыборкаДетальныеЗаписи.Период);
		ЗначениеКлюча.Вставить("ДатаРождения", ВыборкаДетальныеЗаписи.ДатаРождения);
		ЗначениеКлюча.Вставить("КодПороды", ВыборкаДетальныеЗаписи.КодПороды);
		ЗначениеКлюча.Вставить("IDНомер", ВыборкаДетальныеЗаписи.IDНомер);
		ЗначениеКлюча.Вставить("УшнойВыщип", ВыборкаДетальныеЗаписи.УшнойВыщип);
		ЗначениеКлюча.Вставить("ЛевыхСосков", ВыборкаДетальныеЗаписи.ЛевыхСосков);
		ЗначениеКлюча.Вставить("ПравыхСосков", ВыборкаДетальныеЗаписи.ПравыхСосков);
		ЗначениеКлюча.Вставить("НомерЖивотногоОтец", ВыборкаДетальныеЗаписи.НомерЖивотногоОтец);
		ЗначениеКлюча.Вставить("ДатаРожденияОтец", ВыборкаДетальныеЗаписи.ДатаРожденияОтец);
		ЗначениеКлюча.Вставить("НомерЖивотногоМать", ВыборкаДетальныеЗаписи.НомерЖивотногоМать);
		ЗначениеКлюча.Вставить("ДатаРожденияМать", ВыборкаДетальныеЗаписи.ДатаРожденияМать);
		ЗначениеКлюча.Вставить("Статус", ВыборкаДетальныеЗаписи.Статус);
		ЗначениеКлюча.Вставить("ДатаАбортаОпороса", ВыборкаДетальныеЗаписи.ДатаАбортаОпороса);
		ЗначениеКлюча.Вставить("Пролечено", ВыборкаДетальныеЗаписи.Пролечено);
		ЗначениеКлюча.Вставить("ДатаВакцинации", ВыборкаДетальныеЗаписи.ДатаВакцинации);
		ЗначениеКлюча.Вставить("НомерОпороса", ВыборкаДетальныеЗаписи.НомерОпороса);
	КонецЦикла;
	Возврат РегистрыСведений.КарточкаСвиноматки.СоздатьКлючЗаписи(ЗначениеКлюча);
КонецФункции

&НаСервере
Функция ДатаРожденияПриИзмененииНаСервере()
	Если Запись.Период < Запись.ДатаРождения Тогда
		Сообщить("Дата ввода не может быть меньше Даты рождения");
		Запись.ДатаРождения = Null;
	Иначе 
		//Продолжить;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	ДатаРожденияПриИзмененииНаСервере();
	Возраст = (ТекущаяДата() - Запись.ДатаРождения) / (24 * 60 * 60);
КонецПроцедуры

&НаСервере
Процедура ДатаВводПриИзмененииНаСервере()
	Запись.Период = НачалоДня(Запись.Период);
	Если Запись.Период < Запись.ДатаРождения Тогда
		Сообщить("Дата ввода не может быть меньше Даты рождения");
		Запись.ДатаРождения = Null;
	Иначе 
		//Продолжить;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаВводПриИзменении(Элемент)
	ДатаВводПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.Период 			= НачалоДня(Запись.Период);
	ТекущаяДатаВвода 		= Запись.Период;
	ТекущийНомерЖивотного 	= Запись.НомерЖивотного;
	Если Не ЗначениеЗаполнено(Запись.РодителиМать) Тогда
		Запись.РодителиМать = Справочники.НомерЖивотного.ПустаяСсылка();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.РодителиОтец) Тогда
		Запись.РодителиОтец = Справочники.НомерЖивотного.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерЖивотногоПриИзменении(Элемент)
КонецПроцедуры

&НаСервере
Процедура ПолучитьКарточкуСвиноматкиНаСервере()

	Ключ						= ПолучитьКлючЗаписи(ТекущийНомерЖивотного, ТекущаяДатаВвода);
	ЗаписьКарточкиСвиноматки 	= РегистрыСведений.КарточкаСвиноматки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьКарточкиСвиноматки, Ключ);

	ЗаписьКарточкиСвиноматки.Период 			= Запись.Период;
	ЗаписьКарточкиСвиноматки.НомерЖивотного	 	= Запись.НомерЖивотного;
	ЗаписьКарточкиСвиноматки.Записать(Истина);

	ЗаполнитьЗначенияСвойств(ЗаписьКарточкиСвиноматки, Ключ);
	ЗаписьКарточкиСвиноматки.Удалить();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СменитьНомерЖивотногоНаСервере(НомерЖивотного, ДатаВвода, НовыйНомерЖивотного, НоваяДатаВвода)

	НаборЗаписей 		= РегистрыСведений.ЖурналВыбраковки.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.ЖурналОпороса.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.ЖурналОсеменения.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.ЖурналОтъема.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.Вакцинация.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.Аборт.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.Супоросность.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.ПоследнееСобытие.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

	НаборЗаписей = РегистрыСведений.КлючевыеЦифрыОпороса.СоздатьНаборЗаписей();
	СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, НаборЗаписей, НомерЖивотного, НовыйНомерЖивотного, НоваяДатаВвода);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СменитьНомерЖивотногоРегистрНаСервере(ДатаВвода, Знач НаборЗаписей, НомерЖивотного, Знач НовыйНомерЖивотного,
	Знач НоваяДатаВвода)

	Перем Записи;

	НаборЗаписей.Отбор.НомерЖивотного.Установить(НомерЖивотного);
	Попытка
		НаборЗаписей.Отбор.ДатаВвода.Установить(ДатаВвода);
	Исключение
		НаборЗаписей.Отбор.Период.Установить(ДатаВвода);
	КонецПопытки;

	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого Записи Из НаборЗаписей Цикл
			ЗаписьНовая = Неопределено;
			Если ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.ЖурналВыбраковки") Тогда
				ЗаписьНовая  = РегистрыСведений.ЖурналВыбраковки.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.ЖурналОпороса") Тогда
				ЗаписьНовая  = РегистрыСведений.ЖурналОпороса.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.ЖурналОсеменения") Тогда
				ЗаписьНовая  = РегистрыСведений.ЖурналОсеменения.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.ЖурналОтъема") Тогда
				ЗаписьНовая  = РегистрыСведений.ЖурналОтъема.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.Вакцинация") Тогда
				ЗаписьНовая  = РегистрыСведений.Вакцинация.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.Аборт") Тогда
				ЗаписьНовая  = РегистрыСведений.Аборт.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.Супоросность") Тогда
				ЗаписьНовая  = РегистрыСведений.Супоросность.СоздатьМенеджерЗаписи();
			ИначеЕсли ТипЗнч(Записи) = Тип("РегистрСведенийЗапись.КлючевыеЦифрыОпороса") Тогда
				ЗаписьНовая  = РегистрыСведений.КлючевыеЦифрыОпороса.СоздатьМенеджерЗаписи();
			КонецЕсли;
			Если ЗаписьНовая <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЗаписьНовая, Записи);
				ЗаписьНовая.НомерЖивотного = НовыйНомерЖивотного;
				Попытка
					ЗаписьНовая.ДатаВвода = НоваяДатаВвода;
				Исключение
					ЗаписьНовая.Период	  = НоваяДатаВвода;
				КонецПопытки;
				ЗаписьНовая.Записать();
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РодителиМатьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматокВсех(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
		Если ВыбСтрокаМеню <> Неопределено Тогда
			Реквизиты 		= ВыбСтрокаМеню.Значение;
			НомерЖивотного 	= Реквизиты.НомерЖивотного;
			ДатаВвода	  	= Реквизиты.ДатаВвода;
		КонецЕсли;
		ВыбранноеЗначение = ПолучитьДанныеРодителяНаСервере(НомерЖивотного, ДатаВвода, ПредопределенноеЗначение(
			"Перечисление.Пол.Свинка"));
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРодителяНаСервере(НомерЖивотного, ДатаВвод, Пол)

	Возврат Справочники.КарточкаРодители.ПолучитьДанныеРодителей(НомерЖивотного, ДатаВвод, Пол);

КонецФункции

&НаКлиенте
Процедура РодителиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокХряковВсех(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
		Если ВыбСтрокаМеню <> Неопределено Тогда
			Реквизиты 		= ВыбСтрокаМеню.Значение;
			НомерЖивотного 	= Реквизиты.НомерЖивотного;
			ДатаВвода	  	= Реквизиты.ДатаВвода;
		КонецЕсли;
		ВыбранноеЗначение = ПолучитьДанныеРодителяНаСервере(НомерЖивотного, ДатаВвода, ПредопределенноеЗначение(
			"Перечисление.Пол.Хряк"));
	Иначе
		Предупреждение("Хряка с таким номер нет");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодителиСоздание(Элемент, СтандартнаяОбработка)
	Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.КарточкаРодители");

КонецПроцедуры

&НаСервере
Процедура DGTagIdПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	ЗаписьРегистра = РегистрыСведений.ПлемСтадо.СоздатьНаборЗаписей();
	ЗаписьРегистра.Отбор.DGTagId.Установить(Запись.DGTagId);
	ЗаписьРегистра.Прочитать();
	Если ЗаписьРегистра.Количество() > 0 Тогда
		Для Каждого Стр Из ЗаписьРегистра Цикл
			Если Стр.ДатаВвода = Дата(1, 1, 1) Тогда
				Запись.ДатаРождения = Стр.ДатаРождения;
				Возраст = (ТекущаяДата() - Запись.ДатаРождения) / (24 * 60 * 60);
				Запись.КодПороды	= Стр.КодПороды;
				Запись.РодителиМать = Стр.РодителиМать;
				Запись.РодителиОтец	= Стр.РодителиОтец;
				Запись.УшнойВыщип	= Стр.УшнойВыщип;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Свиноматка " + Запись.DGTagId.Наименование + " уже введена." + Символы.ПС
					+ "Номер животого: " + Стр.НомерЖивотного + " Дата ввода: " + Формат(Стр.ДатаВвода, "ДФ=dd.MM.yyyy");
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура DGTagIdПриИзменении(Элемент)
	DGTagIdПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура IDНомерПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	ЗаписьРегистра = РегистрыСведений.ПлемСтадо.СоздатьНаборЗаписей();
	ЗаписьРегистра.Отбор.IDНомер.Установить(Запись.IDНомер);
	ЗаписьРегистра.Прочитать();
	Если ЗаписьРегистра.Количество() > 0 Тогда
		Для Каждого Стр Из ЗаписьРегистра Цикл
			Если Стр.ДатаВвода = Дата(1, 1, 1) Тогда
				Запись.ДатаРождения 	= Стр.ДатаРождения;
				Возраст = (ТекущаяДата() - Запись.ДатаРождения) / (24 * 60 * 60);
				Запись.КодПороды		= Стр.КодПороды;
				Запись.РодителиМать 	= Стр.РодителиМать;
				Запись.РодителиОтец		= Стр.РодителиОтец;
				Запись.УшнойВыщип		= Стр.УшнойВыщип;
				Запись.Пол				= Перечисления.Пол.Свинка;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Свиноматка " + Запись.IDНомер.Наименование + " уже введена." + Символы.ПС
					+ "Номер животого: " + Стр.НомерЖивотного + " Дата ввода: " + Формат(Стр.ДатаВвода, "ДФ=dd.MM.yyyy");
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура IDНомерПриИзменении(Элемент)
	IDНомерПриИзмененииНаСервере();
КонецПроцедуры
